jminor717/esp32_Drone/main/drivers/general/motors/motors.cpp
/**
 *
 * ESP-Drone Firmware
 *
 * Copyright 2019-2020  Espressif Systems (Shanghai)
 * Copyright (C) 2011-2012 Bitcraze AB
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, in version 3.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 *
 * motors.c - Motor driver
 *
 */

#include <stdbool.h>

// FreeRTOS includes
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "../Submodules/DShotRMT/src/DShotRMT.h"
#include "drivers/motors/PositionControlledMotor.h"
#include "drivers/motors/PwmMotors.h"

#include "cfassert.h"
#include "log.h"
#include "motors.h"
#include "pm_esplane.h"
#include "stm32_legacy.h"

#define DEBUG_MODULE "MOTORS"
#include "debug_cf.h"
#include "static_mem.h"

static uint16_t motorsConvBitsTo16(uint16_t bits);
static uint16_t motorsConv16ToBits(uint16_t bits);

uint32_t motor_ratios[] = { 0, 0, 0, 0 };

void motorsPlayTone(uint16_t frequency, uint16_t duration_msec);
void motorsPlayMelody(uint16_t* notes);
void motorsBeep(int id, bool enable, uint16_t frequency, uint16_t ratio);

const MotorPerifDef** motorMap; /* Current map configuration */

const uint32_t MOTORS[] = { MOTOR_M1, MOTOR_M2, MOTOR_M3, MOTOR_M4 };

const uint16_t testsound[NBR_OF_MOTORS] = { NOTE_A4, NOTE_A5, NOTE_F5, NOTE_D5 };

static bool isInit = false;

// ledc_channel_config_t motors_channel[NBR_OF_MOTORS] = {
//     {
//         .channel = MOT_PWM_CH1,
//         .duty = 0,
//         .gpio_num = MOTOR1_GPIO,
//         .speed_mode = LEDC_LOW_SPEED_MODE,
//         .timer_sel = LEDC_TIMER_0,
//     },
//     {
//         .channel = MOT_PWM_CH2,
//         .duty = 0,
//         .gpio_num = MOTOR2_GPIO,
//         .speed_mode = LEDC_LOW_SPEED_MODE,
//         .timer_sel = LEDC_TIMER_0,
//     },
//     {
//         .channel = MOT_PWM_CH3,
//         .duty = 0,
//         .gpio_num = MOTOR3_GPIO,
//         .speed_mode = LEDC_LOW_SPEED_MODE,
//         .timer_sel = LEDC_TIMER_0,
//     },
//     {
//         .channel = MOT_PWM_CH4,
//         .duty = 0,
//         .gpio_num = MOTOR4_GPIO,
//         .speed_mode = LEDC_LOW_SPEED_MODE,
//         .timer_sel = LEDC_TIMER_0,
//     },
// };

//  PWMSpeedControll pwm_ctrl1 = PWMSpeedControll::PWMControll(MOTOR1_GPIO, 2);
//  PWMSpeedControll pwm_ctrl2 = PWMSpeedControll::PWMControll(MOTOR2_GPIO, 3);
//  PWMSpeedControll pwm_ctrl3 = PWMSpeedControll::PWMControll(MOTOR3_GPIO, 4);
//  PWMSpeedControll pwm_ctrl4 = PWMSpeedControll::PWMControll(MOTOR4_GPIO, 5);

// PWMSpeedControll PwmMotors[NBR_OF_MOTORS] = {pwm_ctrl1, pwm_ctrl2, pwm_ctrl3, pwm_ctrl4};

PosContMot RightElevon = PosContMot::PosContMotCreate(MCPWM_UNIT_0, MCPWM_TIMER_0, M1A_PIN, M1B_PIN, M1_POSITION_PIN, DIRECT, 2128);
PosContMot RightRear = PosContMot::PosContMotCreate(MCPWM_UNIT_0, MCPWM_TIMER_1, M2A_PIN, M2B_PIN, M2_POSITION_PIN, DIRECT, 2047);
PosContMot LeftRear = PosContMot::PosContMotCreate(MCPWM_UNIT_1, MCPWM_TIMER_0, M3A_PIN, M3B_PIN, M3_POSITION_PIN, REVERSE, 2047);
PosContMot LeftElevon = PosContMot::PosContMotCreate(MCPWM_UNIT_1, MCPWM_TIMER_1, M4A_PIN, M4B_PIN, M4_POSITION_PIN, REVERSE, 2257);

int32_t RightElevonRatio, RightRearRatio, LeftRearRatio, LeftElevonRatio;

PosContMot Servos[NBR_OF_MOTORS] = { RightElevon, LeftElevon, RightRear, LeftRear };

DShotRMT dshot_01((gpio_num_t)MOTOR1_GPIO, RMT_CHANNEL_0);
DShotRMT dshot_02((gpio_num_t)MOTOR2_GPIO, RMT_CHANNEL_1);
DShotRMT dshot_03((gpio_num_t)MOTOR3_GPIO, RMT_CHANNEL_2);
DShotRMT dshot_04((gpio_num_t)MOTOR4_GPIO, RMT_CHANNEL_3);

DShotRMT DShotMotors[NBR_OF_MOTORS] = { dshot_01, dshot_02, dshot_03, dshot_04 };

void ServoTask(void *param);

STATIC_MEM_TASK_ALLOC(ServoTask, PM_TASK_STACKSIZE);

// Initialization. Will set all motors ratio to 0%
void motorsInit(const MotorPerifDef** motorMapSelect)
{
    int i;

    if (isInit) {
        // First to init will configure it
        return;
    }

    motorMap = motorMapSelect;

    for (i = 0; i < NBR_OF_MOTORS; i++) {
        DEBUG_PRINTI("configuring motor %d", i);
        // DShotMotors[i].begin(DSHOT300, false);
        Servos[i].begin();
    }

    dshot_01.begin(DSHOT300, false);
    dshot_02.begin(DSHOT300, false);
    dshot_03.begin(DSHOT300, false);
    dshot_04.begin(DSHOT300, false);
    DShotMotors[0] = dshot_01;
    DShotMotors[1] = dshot_02;
    DShotMotors[2] = dshot_03;
    DShotMotors[3] = dshot_04;

    // pwm_ctrl1.begin();
    // pwm_ctrl2.begin();
    // pwm_ctrl3.begin();
    // pwm_ctrl4.begin();
    // PwmMotors[0] = pwm_ctrl1;
    // PwmMotors[1] = pwm_ctrl2;
    // PwmMotors[2] = pwm_ctrl3;
    // PwmMotors[3] = pwm_ctrl4;
    STATIC_MEM_TASK_CREATE(ServoTask, ServoTask, "SERVO_TASK", NULL, PM_TASK_PRI);

    isInit = true;
}

void motorsDeInit(const MotorPerifDef** motorMapSelect)
{
    for (int i = 0; i < NBR_OF_MOTORS; i++) {
        //!   ledc_stop(motors_channel[i].speed_mode, motors_channel[i].channel, 0);
    }
}

bool motorsTest(void)
{
    int i;

    for (i = 0; i < sizeof(MOTORS) / sizeof(*MOTORS); i++) {
        // if (motorMap[i]->drvType == BRUSHED)
        // {
#ifdef ACTIVATE_STARTUP_SOUND
        motorsBeep(MOTORS[i], true, testsound[i], (uint16_t)(MOTORS_TIM_BEEP_CLK_FREQ / A4) / 20);
        vTaskDelay(M2T(MOTORS_TEST_ON_TIME_MS));
        motorsBeep(MOTORS[i], false, 0, 0);
        vTaskDelay(M2T(MOTORS_TEST_DELAY_TIME_MS));
#else
        motorsSetRatio(MOTORS[i], MOTORS_TEST_RATIO);
        vTaskDelay(M2T(MOTORS_TEST_ON_TIME_MS));
        motorsSetRatio(MOTORS[i], 0);
        vTaskDelay(M2T(MOTORS_TEST_DELAY_TIME_MS));
#endif
        // }
    }

    return isInit;
}

// Ithrust is thrust mapped for 65536 <==> 60 grams
void motorsSetRatio(uint8_t id, uint16_t ithrust)
{
    // if (ithrust >0){
    //     DEBUG_PRINTI("set motor %d to %d", id, ithrust);
    // }
    if (isInit) {
        uint16_t ratio;

        //! ASSERT(id < NBR_OF_MOTORS);

        ratio = ithrust;

#ifdef ENABLE_THRUST_BAT_COMPENSATED

        if (motorMap[id]->drvType == BRUSHED) {
            float thrust = ((float)ithrust / 65536.0f) * 40; // Modify according to actual weight
            float volts = -0.0006239f * thrust * thrust + 0.088f * thrust;
            float supply_voltage = pmGetBatteryVoltage();
            float percentage = volts / supply_voltage;
            percentage = percentage > 1.0f ? 1.0f : percentage;
            ratio = percentage * UINT16_MAX;
            motor_ratios[id] = ratio;
        }

#endif

        motor_ratios[id] = ratio;
        DShotMotors[id].send_dshot_value(map(ratio, 0, UINT16_MAX, DSHOT_THROTTLE_MIN, DSHOT_THROTTLE_MAX), NO_TELEMETRIC);
#ifdef DEBUG_EP2
        DEBUG_PRINT_LOCAL("motors ID = %d ,ithrust_10bit = %d", id, (uint32_t)motorsConv16ToBits(ratio));
#endif
    }
}

void servoSetPosition(uint8_t id, int32_t ratio, uint32_t Tick)
{
    //RightElevonRatio, RightRearRatio, LeftRearRatio, LeftElevonRatio;
    switch (id) {
    case 0:
        RightElevonRatio = ratio;
        break;
    case 1:
        RightRearRatio = ratio;
        break;
    case 2:
        LeftRearRatio = ratio;
        break;
    case 3:
        LeftElevonRatio = ratio;
        break;
    default:
        break;
    }
}

uint32_t SetCalibrateMode(bool OtherCalibrating, uint8_t id)
{
    switch (id) {
    case 0:
        RightElevon.isCalibrating(OtherCalibrating);
        return RightElevon.CurrentPosition;
    case 1:
        RightRear.isCalibrating(OtherCalibrating);
        return RightRear.CurrentPosition;
    case 2:
        LeftRear.isCalibrating(OtherCalibrating);
        return LeftRear.CurrentPosition;
    case 3:
        LeftElevon.isCalibrating(OtherCalibrating);
        return LeftElevon.CurrentPosition;
    default:
        return 0;
    }
}

void ServoTask(void *param){
    uint32_t Tick =0;

    while(1){
        RightElevon.SetPos(RightElevonRatio, Tick);
        RightRear.SetPos(RightRearRatio, Tick);
        LeftRear.SetPos(LeftRearRatio, Tick);
        LeftElevon.SetPos(LeftElevonRatio, Tick);
        vTaskDelay(1);
        Tick++;
    }
}

int motorsGetRatio(uint32_t id)
{
    // int ratio = 0;
    //! ASSERT(id < NBR_OF_MOTORS);
    //  ratio = motorsConvBitsTo16((uint16_t)ledc_get_duty(motors_channel[id].speed_mode, motors_channel[id].channel));
    return motor_ratios[id];
}

void motorsBeep(int id, bool enable, uint16_t frequency, uint16_t ratio)
{
    //     uint32_t freq_hz = 15000;
    //     ASSERT(id < NBR_OF_MOTORS);
    //     if (ratio != 0) {
    //         ratio = (uint16_t)(0.05*(1<<16));
    //     }

    //     if (enable) {
    //         freq_hz = frequency;
    //     }

    //     ledc_set_freq(LEDC_LOW_SPEED_MODE,LEDC_TIMER_0,freq_hz);
    //     ledc_set_duty(motors_channel[id].speed_mode, motors_channel[id].channel, (uint32_t)motorsConv16ToBits(ratio));
    //     ledc_update_duty(motors_channel[id].speed_mode, motors_channel[id].channel);
}

// Play a tone with a given frequency and a specific duration in milliseconds (ms)
void motorsPlayTone(uint16_t frequency, uint16_t duration_msec)
{
    // motorsBeep(MOTOR_M1, true, frequency, (uint16_t)(MOTORS_TIM_BEEP_CLK_FREQ / frequency) / 20);
    // motorsBeep(MOTOR_M2, true, frequency, (uint16_t)(MOTORS_TIM_BEEP_CLK_FREQ / frequency) / 20);
    // motorsBeep(MOTOR_M3, true, frequency, (uint16_t)(MOTORS_TIM_BEEP_CLK_FREQ / frequency) / 20);
    // motorsBeep(MOTOR_M4, true, frequency, (uint16_t)(MOTORS_TIM_BEEP_CLK_FREQ / frequency) / 20);
    // vTaskDelay(M2T(duration_msec));
    // motorsBeep(MOTOR_M1, false, frequency, 0);
    // motorsBeep(MOTOR_M2, false, frequency, 0);
    // motorsBeep(MOTOR_M3, false, frequency, 0);
    // motorsBeep(MOTOR_M4, false, frequency, 0);
    return;
}

// Plays a melody from a note array
void motorsPlayMelody(uint16_t* notes)
{
    // int i = 0;
    // uint16_t note;     // Note in hz
    // uint16_t duration; // Duration in ms

    // do
    // {
    //   note = notes[i++];
    //   duration = notes[i++];
    //   motorsPlayTone(note, duration);
    // } while (duration != 0);
    return;
}
// LOG_GROUP_START(pwm)
// LOG_ADD(LOG_UINT32, m1_pwm, &motor_ratios[0])
// LOG_ADD(LOG_UINT32, m2_pwm, &motor_ratios[1])
// LOG_ADD(LOG_UINT32, m3_pwm, &motor_ratios[2])
// LOG_ADD(LOG_UINT32, m4_pwm, &motor_ratios[3])
// LOG_GROUP_STOP(pwm)
